In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.591047  1.724932
1  X   beta -0.012216 -0.124727
2  Y  alpha -0.004588 -0.339209
3  Y   beta -2.663506 -0.317054
4  Z  alpha  0.402745  0.036805

In [3]:
#Now let's see how to use groupby

#Lets grab the dataset1 column and group it by the k1 key
group1 = dframe['dataset1'].groupby(dframe['k1'])

#Show the groupby object
group1

In [4]:
#Now we can perform operations on this particular group
group1.mean()

k1
X    0.289416
Y   -1.334047
Z    0.402745
Name: dataset1, dtype: float64

In [5]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

#Now using the data from dataset1, group the means by city and month
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.012216
    JAN   -0.004588
NY  FEB   -2.663506
    JAN    0.496896
Name: dataset1, dtype: float64

In [6]:
# let's see the original dframe again.
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.591047  1.724932
1  X   beta -0.012216 -0.124727
2  Y  alpha -0.004588 -0.339209
3  Y   beta -2.663506 -0.317054
4  Z  alpha  0.402745  0.036805

In [7]:
# WE can also pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.289416  0.800103
Y  -1.334047 -0.328132
Z   0.402745  0.036805

In [8]:
# Or multiple column names
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.591047  1.724932
   beta  -0.012216 -0.124727
Y  alpha -0.004588 -0.339209
   beta  -2.663506 -0.317054
Z  alpha  0.402745  0.036805

In [9]:
# Another useful groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [10]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print ("This is the ",name, " group")
    print (group,end="\n\n")

This is the  X  group
  k1     k2  dataset1  dataset2
0  X  alpha  0.591047  1.724932
1  X   beta -0.012216 -0.124727

This is the  Y  group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.004588 -0.339209
3  Y   beta -2.663506 -0.317054

This is the  Z  group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.402745  0.036805

In [11]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print("Key1 = " ,k1, "Key2 = ",k2)
    print (group,end="\n\n")

Key1 =  X Key2 =  alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.591047  1.724932

Key1 =  X Key2 =  beta
  k1    k2  dataset1  dataset2
1  X  beta -0.012216 -0.124727

Key1 =  Y Key2 =  alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.004588 -0.339209

Key1 =  Y Key2 =  beta
  k1    k2  dataset1  dataset2
3  Y  beta -2.663506 -0.317054

Key1 =  Z Key2 =  alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.402745  0.036805

In [12]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.591047  1.724932
1  X   beta -0.012216 -0.124727

In [13]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.591047  1.724932
 1 -0.012216 -0.124727
 2 -0.004588 -0.339209
 3 -2.663506 -0.317054
 4  0.402745  0.036805,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [14]:
# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.724932
   beta  -0.124727
Y  alpha -0.339209
   beta  -0.317054
Z  alpha  0.036805

In [15]:

animals = DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])

#Now lets add some NAN values
animals.loc[1:2, ['W', 'Y']] = np.nan

#Show
animals

C:\Users\Pratyush\AppData\Local\Temp\ipykernel_9416\630196337.py:6: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  animals.loc[1:2, ['W', 'Y']] = np.nan

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [16]:
# Now let's say I had a dictionary with ebhavior values in it
behavior_map = {'W': 'good', 'X': 'bad', 'Y': 'good','Z': 'bad'}

In [17]:
# Now we can groupby using that mapping
animal_col = animals.groupby(behavior_map, axis=1)

# Show the sum accroding to the groupby with the mapping
animal_col.sum()

# For example [dog][good] = [dog][Y]+[dog][W]

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [18]:
# Now let's try it with a Series
behav_series = Series(behavior_map)

#Show
behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [19]:
# Now let's groupby the Series

animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [20]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [21]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [22]:
# We can also mix functions with arrays,dicts, and Series for groupby methods

# Set a list for keys
keys = ['A', 'B', 'A', 'B']

# Now groupby length of name and the keys to show max values
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [23]:
# We can also use groupby with hierarchaly index levels

#Create a hierarchal column index
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['City','sub_value'])

# Create a dframe with hierarchal index
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

#Multiply values by 100 for clarity
dframe_hr = dframe_hr*100

#Show
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400